УТ.УчетЗадач/src/InformationRegisters/cbr_СобытияПоЗадачам/cbr_СобытияПоЗадачам.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>cbr_СобытияПоЗадачам</name>
  <resources>
    <name>Событие</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>250</length>
      </stringQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Задача</name>
    <type>
      <types>DocumentRef.cbr_Задача</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Дата</name>
    <type>
      <types>Date</types>
    </type>
  </dimensions>
  <dimensions>
    <name>АвторСобытия</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

УТ.УчетЗадач/src/InformationRegisters/cbr_СобытияПоЗадачам/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
#Область СлужебныеПроцедурыИФункции
// Создать запись в регистр сведений
// Параметры:
//  Задача - ДокументСсылка.cbr_Задача
//  Событие - Строка.
Процедура ЗаписатьСобытие(Задача, Событие, Пользователь = Неопределено) Экспорт
	Если Не ЗначениеЗаполнено(Пользователь) Тогда
		Пользователь = Пользователи.АвторизованныйПользователь();
	КонецЕсли;
	
	МенеджерЗаписи = СоздатьМенеджерЗаписи();
	МенеджерЗаписи.Дата = ТекущаяДатаСеанса();
	МенеджерЗаписи.Задача = Задача;
	МенеджерЗаписи.АвторСобытия = Пользователь;
	МенеджерЗаписи.Период = МенеджерЗаписи.Дата;
	МенеджерЗаписи.Событие = Событие;
	МенеджерЗаписи.Записать();
КонецПроцедуры

// Создать набор записей в регистр сведений
// Параметры:
//  События - Массив Из Структура:
//		* Задача - ДокументСсылка.cbr_Задача
//		* Событие -  Строка.
Процедура ЗаписатьНаборСобытий(События, Пользователь = Неопределено) Экспорт
	Если Не ЗначениеЗаполнено(Пользователь) Тогда
		Пользователь = Пользователи.АвторизованныйПользователь();
	КонецЕсли;
	
	НаборЗаписей = СоздатьНаборЗаписей();
	НаборЗаписей.Записывать = Истина;
	
	Для Каждого Событие Из События Цикл
		Запись = НаборЗаписей.Добавить();
		Запись.Дата = ТекущаяДатаСеанса();
		Запись.Задача = Событие.Задача;
		Запись.АвторСобытия = Пользователь;
		Запись.Период = Запись.Дата;
		Запись.Событие = Событие.Событие;
	КонецЦикла;
	
	НаборЗаписей.Записать(РежимЗамещения.Слияние);
КонецПроцедуры
#КонецОбласти
#КонецЕсли
